{
  "AB6IX": {
    "info": [
      "AB6IX(Korean:에이비식스;RR:Eibisikseu;pronounced as A-B-Six) is a South Koreanboy bandformed byBrand New Music. The group currently consists of four members: Jeon Woong,Kim Dong-hyun,Park Woo-jinandLee Dae-hwi. Former leader Lim Young-min's departure from the group was announced on June 8, 2020.[4]",
      "The group debuted on May 22, 2019, with their firstEPtitledB:Complete."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/AB6IX"
  },
  "aespa": {
    "info": [
      "Aespa(/ˈɛsˌpɑː/ES-pah;Korean:에스파;RR:Eseupa, stylized inall lowercaseor asæspa) is a South Koreangirl groupformed bySM Entertainment. The group consists of four members:Karina,Giselle,Winter, andNingning. The group is known for popularizing themetaverseconcept andhyperpopmusic inK-pop.[1][2][3]",
      "Aespa debuted on November 17, 2020, with the single \"Black Mamba\", which achieved the highest number of views in 24 hours for a K-pop group's debut video.[4]Their third single, \"Next Level\", was released in May 2021 to widespread commercial and critical success, peaking at number two on theCircle Digital Chartand earning the Daesang[a]for Song of the Year at the19th Korean Music Awards. In October of the same year, Aespa released their firstextended play(EP)Savage, which became the highest-charting debut album by a K-pop girl group on the USBillboard200chart at number 20, while itstitle trackpeaked at number two in South Korea.",
      "In July 2022, Aespa released their second EPGirls, which broke the record for the best-selling album by a K-pop girl group in history and became the first to sell one million copies in the first week of release. It also debuted at number three on theBillboard200 chart, marking their first top-ten album in the US. Their third EP,My World, was released in May 2023, achieving over two million sales and becoming their second top-ten album on theBillboard200. The group released their first studio album,Armageddon, in May 2024. It was preceded by the commercially successful lead single \"Supernova\", which topped the Circle Digital Chart for eleven weeks and won Song of the Year at the2024 MAMA Awardsand2024 Melon Music Awards. In October 2024, thetitle trackof Aespa's fifth EPWhiplashbecame their first top-ten hit on theBillboardGlobal 200at number eight."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/aespa"
  },
  "AKMU": {
    "info": [
      "AKMU(/ɑːŋmjuː/;Korean:악뮤), formerlyAkdong Musician(/ɑːŋdɒŋmjuːˈzɪʃn/;Korean:악동뮤지션), is a South Korean duo consisting of siblingsLee Chan-hyukandLee Su-hyunsigned toYG Entertainment. As prominent figures of South Korea, their musical impact in their native country has earned themnumerous accoladesand thehonorific title\"The Nation's Siblings\". They are also cited as \"musical prodigies\" and \"geniuses\".",
      "Propelled to national stardom through thesecond installationofK-pop Star(2012–2013), AKMU officially debuted in April 2014 withPlay, astudio albumsolely crafted by Lee Chan-hyuk alone. It topped theGaon Album Chart, became their first entry onBillboard, namely theHeatseekers Albums Chartand theWorld Albums Chart, and birthed the three titular singles, \"200%\", \"Give Love\", and \"Melted\". It was well received by the public and critics, having sold more than 6.9 million downloads,[2]and was awarded Best Pop Album in the 12thKorean Music Awards.[3]Following the release of their critically acclaimedPubertyseries, consisting ofSpring(2016) andWinter(2017), the sibling duo reached greater career heights withSailing(2019) and its lead single \"How Can I Love the Heartbreak, You're the One I Love\", which not only topped theCircle Digital Chart, but also sold 2.5 million digital copies, following \"Last Goodbye\" (2017), and was the fourth single to be certified triple platinum for streaming inKorea Music Content Associationhistory."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/AKMU"
  },
  "Apink": {
    "info": [
      "Apink(Korean:에이핑크;RR:Eipingkeu;Japanese:エーピンク) is a South Koreangirl groupformed byIST Entertainment, (formerly Play M Entertainment,[1]A Cube Entertainment,[2]and Plan A Entertainment[3]) and managed by Choi Creative Lab as of April 2024. The group debuted on April 19, 2011, with theextended play(EP)Seven Springs of Apink.Apink currently consists of five members:Chorong,Bomi,Eunji,Namjoo, andHayoung. Originally a septet, Yookyung left in 2013 to pursue her education andNaeunleft to pursue her acting career in 2022. As of 2024[update], the group is no longer listed on IST Entertainment's website.",
      "Since their debut, Apink has won awards at shows such as theGolden Disc Awards, theSeoul Music Awardsand theMnet Asian Music Awards. Their first music program win was onM Countdownon January 5, 2012, for \"My My\" from their second EPSnow Pink. To date, Apink has released nine Korean EPs, five Korean studio albums, and three Japanese studio albums."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/Apink"
  },
  "ATEEZ": {
    "info": [
      "Ateez(Korean:에이티즈;RR:Eitijeu; stylized inall caps) is a South Koreanboy bandformed byKQ Entertainment. The group consists of eight members:Hongjoong, Seonghwa, Yunho, Yeosang, San, Mingi, Wooyoung andJongho. They debuted on October 24, 2018, with theextended play(EP)Treasure EP.1: All to Zero.",
      "As of January 2025, Ateez have released eleven EPs, four studio albums, twenty-four singles and one single album in the Korean language, as well as two single albums, three EPs and two studio albums in the Japanese language. Their albumsTreasure EP.Fin: All to Action,Treasure Epilogue: Action to Answer, theZero: Feveralbumtetralogy,[a]Spin Off: From the Witness,The Worldalbumtrilogy,Golden Hour: Part.1andGolden Hour: Part.2each topped the South KoreanCircle Album Chart, withZero: Fever Part.1becoming the group's first to be certified platinum[5]andThe World EP.1: Movementbecoming their first to be certified million in the country.[6]The group achieved their first No.1 on theBillboard 200with their second studio albumThe World EP.Fin: Willand has secured multiple No.1's on theBillboard Top Albums Sales Chart.[7]They are also the first South Korean musical act to have three different releases chart in the top 10 of theUK Official Albums Chartwithin a single year.[8]",
      "Often referred to as \"Global Performance Idols\" by Korean media and dubbed \"Next Generation Leaders\" by theKorean Ministry of Culture, Sports, and Tourismin 2020, Ateez have sold over seven million physical albums worldwide. Their accolades include Worldwide Fans' Choice at the2019,2020, and2023Mnet Asian Music Awardsandbonsangawards (main prize) at the 4thFact Music Awards, at the 30th and 31stSeoul Music Awards. They also won the Grand Honor's Choice award (daesang) at the 2024Korea Grand Music Awards.[9]The group has also served as official global ambassadors for Korean culture and tourism.[10][11]In 2024, Ateez became the first K-pop boy group to perform atCoachellaand also the first K-pop group to headline theMawazinemusic festival in Morocco.[12][13]",
      "Their primary producer is their labelmateEden, the leader ofEden-ary.[14]"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/ATEEZ"
  },
  "B1A4": {
    "info": [
      "B1A4(Korean:비원에이포) is a South Koreanboy bandformed byWM Entertainment. The group debuted on April 23, 2011, with the single \"O.K\" from the EPLet's Fly, after being introduced to the public through awebtoon. They have released nine studio albums (four Korean and five Japanese) and sevenEPs, as well as four compilation albums. The group had considerable commercial and critical success in both the Korean and Japanese markets. They have also toured in the United States.[2]"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/B1A4"
  },
  "BABYMONSTER": {
    "info": [
      "Babymonster(Korean:베이비몬스터;RR:Beibimonseuteo; stylized inall caps), also referred to asBaemon(/beɪmɒn/BAY-mon;베몬), is a South Koreangirl groupformed byYG Entertainment, consisting of seven members: Ruka, Pharita, Asa, Ahyeon, Rami, Rora, and Chiquita. They debuted as a full ensemble on April 1, 2024, with their eponymousextended play(EP)Babymons7er. Its single, \"Sheesh\", became their first top-ten hit on Korea'sCircle Digital Chart. Babymonster subsequently released their debut studio album,Drip, on November 1."
    ],
    "name_used": "korean",
    "url": "https://en.wikipedia.org/wiki/베이비몬스터"
  },
  "BADVILLAIN": {
    "info": [
      "Badvillain(Korean:배드빌런;RR:Baedeubilleon; stylized inall caps) is a South Koreangirl groupformed byBPM Entertainment. The group consists of seven members: Emma, Chloe Young, Hu'e, Ina, Yunseo, Vin, and Kelly. They made their debut on June 3, 2024, with their single albumOverstep."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/BADVILLAIN"
  },
  "BIGBANG": {
    "info": [
      "BigBang(Korean:빅뱅; stylized inall caps) is a South Koreanboy bandformed byYG Entertainment. The group consists of three members:G-Dragon,Taeyang, andDaesung. Originally a five-piece band,Seungriretired from the entertainment industry in March 2019[2]andT.O.Pleft in May 2023.[3]Dubbed the \"Kings of K-pop\", they helped spread theKorean Waveinternationally and are considered one of the most influential acts inK-pop.[4][5][6][7][8][9]They are known for their trendsetting musical experimentation, self-production, and stage presence.[10][11]",
      "Although their debut album,BigBang Vol.1(2006), was released to lukewarm reception, greater success followed with a string of hit singles: \"Lies\", which topped Korean music charts for a record-breaking six consecutive weeks and wonSong of the Yearat the2007 Mnet Km Music Festivaland the 2008Seoul Music Awards; \"Last Farewell\", \"Haru Haru\", and \"Sunset Glow\". After winningArtist of the Yearat the2008 Mnet Korean Music Festivaland the 2008 Seoul Music Awards, the group released four Japanese studio albums—BigBang(2009),BigBang 2(2011),Alive(2012), andMade Series(2016)—all of which were certified gold by theRecording Industry Association of Japan(RIAJ).",
      "After a two-year hiatus in South Korea, the quintet returned with their fourthEP,Tonight(2011), which won them the inauguralBest Worldwide Act Awardat the2011 MTV Europe Music Awards.[12]Their fifth EP,Alive(2012), became the first Korean album to chart on the USBillboard200. Their third studio album,Made(2016), was preceded by several chart-topping singles and won the group Artist of the Year awards at the2015 Mnet Asian Music Awardsfor the third time and at the2015 Melon Music Awards. Its supporting tour, theMade World Tour, attracted 1.5 million people and set a new record for the most-attended concert tour headlined by a Korean act in history at the time.[13][14]",
      "Eleven of BigBang's singles have reached number one on South Korea'sGaon Digital Chartand have collectively remained atop theMeloncharts for a record 51 weeks.ForbesKorearanked them as one of themost powerful celebrities in South Koreafrom 2009 to 2016 (placing 2nd in 2009, 2012 and 2014); and they were the first Korean artists to be included on theForbesCelebrity 100(2016) and30 Under 30list of most influential musicians in the world (2017).[15][16]"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/BIGBANG"
  },
  "Billlie": {
    "info": [
      "Billlie(Korean:빌리;RR:Billi; stylized asBi11lieorBilllǃə) is a South Korean girl group formed byMystic Story. Billlie debuted on November 10, 2021, with theextended play(EP)The Billage of Perception: Chapter One. The group originally consisted of six members: Moon Sua, Suhyeon, Haram, Tsuki, Siyoon and Haruna. A seventh member, Sheon, later joined the group."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/Billlie"
  },
  "BOYNEXTDOOR": {
    "info": [
      "BoyNextDoor(Korean:보이넥스트도어;RR:Boinekseuteudoeo; stylized inall caps) is a South Koreanboy bandformed byKOZ Entertainmentin 2023. The group consists of six members: Sungho, Riwoo, Jaehyun, Taesan, Leehan, and Woonhak. Characterized by its eponymous 'boy next door' image, the group defines their work aseasy listeningwith a thematic focus on daily life.",
      "BoyNextDoor debuted on May 30, 2023, with thesingle albumWho!, which formed the first installment in the First Love trilogy that defined the group's first releases. Theextended play(EP)Why..followed the same year and marked the group's first appearance on theBillboard200chart. The group's second EP,How?(2024), became the group's first release to top theCircle Album Chart.",
      "The group debuted in Japan later that year throughUniversal Music Japanwith themaxi single\"And,\", which was followed by their third EP19.99(2024). They embarked on their debutKnock On Vol.1 Tourin December 2024 and released their first digital single \"If I Say, I Love You\" in January 2025. The group's fourth EP,No Genre, will be released in May."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/BoyNextDoor"
  },
  "BTOB": {
    "info": [
      "BtoB(/ˈbiːtuːbiː/BEE-too-bee;Korean:비투비; acronym forBorn to Beat; often stylized inall caps) is a South Koreanboy bandformed in 2012 byCube Entertainment. The group consists ofSeo Eun-kwang,Lee Min-hyuk,Lee Chang-sub,Im Hyun-sik,Peniel ShinandYook Sung-jae. Originally a septet,Jung Il-hoondeparted from the group on December 31, 2020.",
      "BtoB debuted on March 21, 2012, performing \"Insane\" (비밀) and \"Imagine\" onM Countdown.[1]The group's debut EP,Born to Beatwas released on April 3, 2012. They released their first full-length album,Complete, in June 2015. In November 2014, they made their Japanese debut with \"Wow\" under the Japanese agency Kiss Entertainment.",
      "Since the group's 2012 debut, they have received multiple awards, including the 30thGolden Disc Awards Best Vocal Groupin 2016,2017 Melon Music AwardsTop 10Bonsangand 25thSeoul Music Awards Ballad Awardin 2018.[2]Five of their albums topped theGaon Album Chart, and nine of their singles peaked in top ten on the nationalGaon Digital Chart."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/BTOB"
  },
  "BTS": {
    "info": [
      "BTS(Korean:방탄소년단;RR:Bangtan Sonyeondan;lit.Bulletproof Boy Scouts), also known as theBangtan Boys, is a South Koreanboy bandformed in 2010. The band consists ofJin,Suga,J-Hope,RM,Jimin,V, andJung Kook, who co-write or co-produce much of their material. Originally ahip hopgroup, they expanded their musical style to incorporate a wide range of genres, while their lyrics have focused on subjects including mental health, the troubles of school-age youth andcoming of age, loss, the journey towards self-love, individualism, and the consequences of fame and recognition. Their discography and adjacent work has also referenced literature, philosophy and psychology, and includes analternate universestoryline.",
      "BTS debuted in 2013 underBig Hit Entertainmentwith the single album2 Cool 4 Skool.BTS released their first Korean and Japanese-language studio albums,Dark & WildandWake Uprespectively, in 2014. The group's second Korean studio album,Wings(2016), was their first to sell one million copies in South Korea. By 2017, BTS had crossed into the global music market and led theKorean Waveinto the United States, becoming the first Korean ensemble to receive aGold certificationfrom theRecording Industry Association of America(RIAA) for their single \"Mic Drop\", as well as the first act from South Korea to top theBillboard200with their studio albumLove Yourself: Tear(2018). In 2020, BTS became the fastest group sincethe Beatlesto chart four US number-one albums in less than two years, withLove Yourself: Answer(2018) becoming the first Korean album certified Platinum by the RIAA; in the same year, they also became the first all-South Korean act to reach number one on both theBillboardHot 100andBillboardGlobal 200with their Grammy-nominated single \"Dynamite\". Follow-up releases \"Savage Love\", \"Life Goes On\", \"Butter\", \"Permission to Dance\", and \"My Universe\" made them the fastest act to earn six US number-one singles since the Beatles in 1966.",
      "As of 2023[update], BTS is the best-selling musical act in South Korean history according to theCircle Chart, having sold in excess of 40 million albums.[2]Their studio albumMap of the Soul: 7(2020) is thefourth best-selling album of all time in South Korea, as well as the first in the country to surpass both four and five million registered sales. They are the first non-English-speaking and Asian act to sell out concerts atWembley Stadiumand theRose Bowl(Love Yourself World Tour, 2019), and were named theInternational Federation of the Phonographic Industry's (IFPI)Global Recording Artist of the Yearfor both 2020 and 2021. The group'saccoladesinclude multipleAmerican Music Awards,BillboardMusic Awards,Golden Disc Awards, and nominations for fiveGrammy Awards. Outside of music, they have addressed three sessions of theUnited Nations General Assemblyand partnered withUNICEFin 2017 to establish theLove Myselfanti-violence campaign. Featured onTime'sinternational cover as \"Next Generation Leaders\" and dubbed the \"Princes of Pop\", BTS has also appeared onTime'slists of the 25 most influential people on the internet (2017–2019) and the100 most influential people in the world(2019), and in 2018 became the youngest recipients of the South KoreanOrder of Cultural Meritfor their contributions in spreading the Korean culture and language.",
      "On June 14, 2022, the group announced a scheduled pause in group activities to enable the members to complete their 18 months ofmandatory South Korean military service, with a reunion planned for 2025.[3]Jin, the eldest member, enlisted on December 13, 2022; the others followed in 2023."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/BTS"
  },
  "CLASSy": {
    "info": [
      "Classy(/ˈklæsi/;Korean:클라씨;RR:Keullassi; stylized asCLASSyorCLASS:y) is a South Koreangirl groupformed through theMBCreality competition showMy Teenage Girland co-managed by M25, a subsidiary ofPocketDol Studio, andUniversal Music Japan. The group consists of seven members: Won Ji-min, Kim Seon-you, Myung Hyung-seo, Hong Hye-ju, Kim Ri-won, Park Bo-eun, and Yoon Chae-won. They officially debuted on May 5, 2022, with theextended play(EP)Class Is Over."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Classy_(group)"
  },
  "CRAVITY": {
    "info": [
      "Cravity(Korean:크래비티;RR:Keuraebiti) is a South Koreanboy bandformed byStarship Entertainment. The group is composed of nine members: Serim, Allen, Jungmo, Woobin, Wonjin, Minhee, Hyeongjun, Taeyoung, and Seongmin.[3]They debuted on April 14, 2020, with theirextended play,Season 1. Hideout: Remember Who We Are.",
      "The group was dubbed as \"Monster Rookies\" in 2020, who \"emerge as a global artist that attracted attention of the fans globally.\"[4]They became the first 2020 rookie artist to debut on theBillboardK-pop Hot 100, and earned numerous awards including \"New Artist of the Year\" at the 12thMelon Music Awards, \"Best of Next\" at the 2020Mnet Asian Music Awards, and \"Rookie Award\" in the 4thSoribada Awards.[5]In November 2024, the group emerged as the winner ofMnet'sreality competitionsurvival showRoad to Kingdom: Ace of Ace.[6]"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/CRAVITY"
  },
  "DKB": {
    "info": [
      "DKBmay stand for:"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/DKB"
  },
  "Dreamcatcher": {
    "info": [
      "In someNative AmericanandFirst Nationscultures, adreamcatcher(Ojibwe:ᐊᓴᐱᑫᔒᓐᐦ,romanized:asabikeshiinh, theinanimate formof the word for 'spider')[1]is a handmadewillowhoop, on which is woven anetorweb. It may also be decorated with sacred items such as certain feathers or beads. Traditionally, dreamcatchers are hung over acradleor bed as protection.[2]It originates inAnishinaabeculture as \"the spider web charm\" –asubakacin'net-like' (White Earth Nation);bwaajige ngwaagan'dream snare' (Curve Lake First Nation)[3]– a hoop with woven string or sinew meant to replicate a spider's web, used as a protective charm for infants.[2]",
      "Dream catchers were adopted in thePan-Indian Movementof the 1960s and 1970s and gained popularity as widely marketed \"Native crafts items\" in the 1980s.[4]"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/Dreamcatcher"
  },
  "ENHYPEN": {
    "info": [
      "Enhypen(Korean:엔하이픈;RR:Enhaipeun;Japanese:エンハイプン,romanized:Enhaipun; stylized inall caps) is a South Koreanboy bandformed byBelift Lab. Formerly a joint venture betweenCJ ENMandHybe Corporation,[4]the group was formed through the 2020 survival competition showI-Land. The group consists of seven members: Heeseung, Jay, Jake,Sunghoon, Sunoo, Jungwon, andNi-Ki. They debuted on November 30, 2020, with theextended play(EP)Border: Day One."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/ENHYPEN"
  },
  "EPEX": {
    "info": [
      "Epex(Korean:이펙스;RR:Ipekseu; stylized inall caps) is a South Koreanboy bandformed  and managed byC9 Entertainment. The group consists of eight members: Wish, Keum, Mu, A-Min, Baekseung, Ayden, Yewang, and Jeff. They debuted on June 8, 2021, with their firstextended play(EP)Bipolar Pt.1: Prelude of Anxiety."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Epex"
  },
  "EVERGLOW": {
    "info": [
      "Everglow(Korean:에버글로우;RR:Ebeogeullou, stylized inall caps) is a South Koreangirl groupformed byYuehua Entertainment. The group is composed of six members: E:U,Sihyeon, Mia, Onda, Aisha, and Yiren. Cited as the \"ultimate performance boss\" by Korean media, they are known for theirEDM-trap-inspiredsynth-popsound and adopting the \"girl crush\" concept in K-pop.",
      "Everglow debuted on March 18, 2019 with the single albumArrival of Everglowand its single \"Bon Bon Chocolat\", quickly earning the nickname of \"monster rookies\" from domestic media for their performance potential. Their subsequent singles, \"Adios\" (2019) and \"Dun Dun\" (2020), peaked at numbers 2 and 3 respectively on the U.S.World Digital Song Saleschart, further establishing the group's global presence. Their single \"La Di Da\" (2020), was named the best K-pop song of 2020 byBillboard."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Everglow"
  },
  "EXO": {
    "info": [
      "Exo(Korean:엑소;RR:Ekso; stylized inall caps) is a South Korean-Chineseboy bandbased inSeoulformed bySM Entertainmentin 2011 and debuted in 2012. The group consists of nine members:Xiumin,Suho,Lay,Baekhyun,Chen,Chanyeol,D.O.,KaiandSehun. They are noted for releasing music and performing extensively in Korean,Mandarinand Japanese.",
      "The group debuted with twelve members separated into Exo-K (Suho, Baekhyun, Chanyeol, D.O., Kai and Sehun) and Exo-M (Xiumin, Lay, Chen,Kris,LuhanandTao). Members Kris, Luhan, and Tao departed the group individually amid legal battles with SM Entertainment in 2014 and 2015. Exo-K and Exo-M performed music in Korean and Mandarin, respectively, until the release of their thirdEPOverdosein 2014. Since then, Exo have exclusively performed as one group, although their music continues to feature multiple languages. Members Chen, Baekhyun, and Xiumin debuted in the sub-unitExo-CBXin 2016. Members Sehun and Chanyeol began promoting as the sub-unitExo-SCin 2019. All members also maintain individual careers in music, film and television.",
      "Exo's first studio albumXOXO(2013), released alongside breakthrough single \"Growl\", was received positively by critics and sold over one million copies with its repackage, making Exo the first Korean act to do so in twelve years. The group's later works expanded on their early commercial success, with their subsequent Korean studio albums combined with their repackages each selling over one million copies. Exo's sixth studio album,Don't Mess Up My Tempo(2018), became their highest-charting album on the USBillboard200, debuting at number 23. Their eighth studio album,Exist(2023), is their best selling album in South Korea, where it sold over 2 million copies.",
      "Exo have won numerous awards, including five consecutiveAlbum of the Yearawards at theMAMA Awardsand two consecutive Artist of the Year awards at theMelon Music Awards, and have performed over 100 concerts across four headlining tours and multiple joint tours. The group ranked as one of the top five most influential celebrities on theForbesKorea Power Celebrity 40list from 2014 to 2018. They have been labelled \"Nation's Pick\" by theKorea Tourism Organizationand by some as the \"Kings of K-pop\". Outside of music, the group members have endorsed brands such asNature RepublicandSamsungand participate in philanthropic efforts such as Smile For U, an ongoing project by SM Entertainment andUNICEFthat began in 2015."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/EXO"
  },
  "FIFTYFIFTY": {
    "info": [
      "Fifty Fifty(Korean:피프티 피프티;RR:Pipeuti Pipeuti; stylized inall caps) is a South Koreangirl groupformed byAttraktin 2022. The group consists of five members: Keena, Chanelle Moon, Yewon, Hana, and Athena.",
      "Fifty Fifty debuted on November 18, 2022, with theirextended play(EP)The Fifty. They experienced a commercial breakthrough with their viral hit single \"Cupid\". The single, which was released in  February 2023, made Fifty Fifty the fastest K-pop group to enter the USBillboardHot 100andUK Singles Chart, within four months of debut.[1]Furthermore, it made them the first K-pop girl group to enter the top ten of the UK charts.[2]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Fifty_Fifty_(group)"
  },
  "GIDLE": {
    "info": [
      "(G)I-dle(Korean:(여자)아이들;RR:Yeoja Aideul;lit.Girls Idol; stylized inall caps) is a South Koreangirl groupformed byCube Entertainmentin 2018. The group consists of five members:Miyeon,Minnie,Soyeon,Yuqi, andShuhua.[2]The group was originally a sextet untilSoojinleft the group on August 14, 2021.[3]They are praised for theirmusicality, versatility, and for breaking stereotypes as a \"self-producing\"idolgroup, known for writing and producing much of their material. Since their debut, they have been acknowledged as one of the most successful South Korean girl groups outside of the \"big four\"[a]record labels.[4][5]",
      "(G)I-dle debuted with the extended playI Amand its lead single \"Latata\" on May 2, 2018. After several moderately successful releases, the group rose to prominence with \"Tomboy\", the viral lead single of their first studio albumI Never Die(2022). The song was a critical and commercial success, peaking at number one on theCircle Digital Chart. Their next single, \"Nxde\", also topped the chart and made (G)I-dle the only artist to have two songs achieve aperfect all-killin 2022. It also made them the first act from an independent label to debut on the USBillboardPop Airplaychart with a non-English song.",
      "(G)I-dle's sixth EP,I Feel(2023), produced the single \"Queencard\", which marked the group's third consecutive number-one single in South Korea. The album became their first to sell over one million copies in South Korea, and they sold two million copies worldwide in 2023, according to theIFPI. The group's second studio album,2(2024), was also met with commercial success and sold over one million copies in South Korea. It yielded the top-tenlead single\"Super Lady\" and the number-one song \"Fate\", which found success despite not being released as a single."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/(G)I-dle"
  },
  "GirlsDay": {
    "info": [
      "Girl's Day(Korean:걸스데이) is a South Korean girl group formed byDream T Entertainmentin 2010. The group consists of membersSojin,Minah,Yura, andHyeri. Members Jisun and Jiin officially left the group in 2010, while Jihae left in late 2012.",
      "After said member departures, the quartet went on to become one of the most popular and commercially successful groups of its era. In order of release, the group's biggest hits include \"Twinkle Twinkle\", \"Hug Me Once\", \"Expect\", \"Something\", \"Darling\", and \"Ring My Bell\", all of which have sold more than one million digital copies each.",
      "Over the span of their career, Girl's Day has endorsed over 20 brands, includingLG Electronics,Ezaki Glico'sPocky,Lotte World,NexonandBullsone. Girl's Day ranked 13th inKorea Power Celebrityin 2015, a list ranking Korea's most powerful and influential celebrities.[1]In 2016, the group ranked 26th, whereas member Hyeri ranked 3rd.[2][3]",
      "In 2019, the four members decided not to renew their contracts with Dream T Entertainment, but have stated that they haven't disbanded.[4]Their last release was theEPEveryday #5in 2017."
    ],
    "name_used": "korean",
    "url": "https://en.wikipedia.org/wiki/걸스데이"
  },
  "GirlsGeneration": {
    "info": [
      "Girls' Generation(Korean:소녀시대;RR:Sonyeo Sidae), also known asSNSD, is a South Koreangirl groupformed bySM Entertainment. The group is composed of eight members:Taeyeon,Sunny,Tiffany,Hyoyeon,Yuri,Sooyoung,Yoona, andSeohyun. Originally a nine-piece ensemble, memberJessicadeparted from the group in September 2014. Among the most knownSouth Korean figuresand successfulK-popgroups worldwide, Girls' Generation has earnednumerous accoladesand thehonorific nickname\"The Nation's Girl Group\" in their home country.",
      "Girls' Generation debuted on August 5, 2007, with the single \"Into the New World\" from theireponymous Korean album. The group rose to fame in 2009 with the single \"Gee\", which claimed the top spot onKBS'sMusic Bankfor a record-breaking nine consecutive weeks and wasMelon's most popular song of the 2000s decade. The group cemented their popularity in Asia with follow-up singles \"Genie\", \"Oh!\", and \"Run Devil Run\", which were released between mid-2009 and early 2010. Their second Korean studio album,Oh!(2010), won theGolden Discaward for Album of the Year (Disk Daesang), making the group the first and only female act to win the Album Daesang.",
      "Girls' Generation ventured into the Japanese music scene in 2011 with theireponymous Japanese album, which became the first album by a non-Japanese girl group to be certifiedmillionby theRIAJ. The group's third Korean studio album,The Boys, was the best-selling album of 2011 in South Korea. An English version of the single \"The Boys\" was released in an attempt to expand the group's endeavor to the global music scene. The group's fourth Korean studio album,I Got a Boy(2013), was supported by thetitle track, which won Video of the Year at the inauguralYouTube Music Awards. Girls' Generation continued to build upon their popularity with their fifth and sixth Korean studio albums,Lion Heart(2015) andHoliday Night(2017). Following a five-year hiatus to focus on their individual careers, they returned with their seventh Korean studio albumForever 1(2022).",
      "The group's signature musical styles are characterized aselectropopandbubblegum pop, though their sound has varied widely, incorporating various genres includinghip hop,R&B, andEDM. In 2017,Billboardhonoured Girls' Generation as the \"Top K-pop Girl Group of the Past Decade\".[1]They are the first Asian girl group to achieve five music videos with over 100 million views onYouTubewith \"Gee\", \"I Got a Boy\", \"The Boys\", \"Mr. Taxi\", and \"Oh!\". In Japan, they became the first non-Japanese girl group to have three number-one albums on theOricon Albums Chart, and their three Japanese concert tours attracted a record-breaking 550,000 spectators."
    ],
    "name_used": "korean",
    "url": "https://en.wikipedia.org/wiki/소녀시대"
  },
  "GOT7": {
    "info": [
      "Got7(Korean:갓세븐;RR:Gatsebeun; stylized in all caps) is a South Koreanboy bandformed byJYP Entertainment. The group is composed of seven members:Jay B,Mark,Jackson,Jinyoung,Youngjae,BamBam, andYugyeom. Got7 debuted in January 2014 with the release of their firstEPGot It?, which peaked at number two on theGaon Album Chartand number one onBillboard'sWorld Albums Chart. The group gained attention also for their live performances, which often include elements ofmartial arts trickingand street dancing.",
      "In late 2014, Got7 signed withSony Music Entertainment Japanand ventured into the Japanese market to release their debut Japanese-language single \"Around the World.\" They returned to South Korea a month later to release their first full-length studio albumIdentify, which topped the nation's charts. In 2015, Got7 released the EPsJust RightandMad, which yielded their most commercially successful single, \"Just Right.\" In 2016, they moved into the Japanese market with a full-length Japanese studio album,Moriagatteyo, which entered theOricon Albums Chartat number three.",
      "Their fifth Korean EPFlight Log: Departureand their second full-length studio albumFlight Log: Turbulencewere both chart-toppers, and the 2017 EPFlight Log: Arrival, the third and final part of the group'sFlight Logseries, was their first album to sell more than 300,000 copies.",
      "The group departed from JYP Entertainment in January 2021, following the expiration of their contract with the agency.[3]"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/GOT7"
  },
  "H1KEY": {
    "info": [
      "H1-Key(/haɪ-kiː/;Korean:하이키;RR:Haiki; read asHigh-key; stylized asH1-KEY) is a South Koreangirl group. Formed and managed by Grandline Group (GLG) andSony Music Korea, the group is composed of four members: Seoi, Riina, Hwiseo, and Yel. Former member Sitala left the group on May 25, 2022, and Hwiseo was introduced as a new member on June 14, 2022. They made their debut with the release of their firstsingle album,Athletic Girl, on January 5, 2022."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/H1-Key"
  },
  "Hearts2Hearts": {
    "info": [
      "Hearts2Hearts(Korean:하츠투하츠;RR:HacheutuHacheu) is a South Koreangirl groupformed bySM Entertainment. The group consists of eight members: Carmen, Jiwoo, Yuha, Stella, Juun,A-na, Ian, andYe-on. They debuted on February 24, 2025, with the single albumThe Chaseand its lead single of thesame name."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/Hearts2Hearts"
  },
  "Highlight": {
    "info": [
      "HighlightorHighlightsmay refer to:"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/Highlight"
  },
  "iKON": {
    "info": [
      "Ikonis an alternative spelling oficon, and the normal spelling in German and many other languages.",
      "IkonoriKONmay also refer to:"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/iKON"
  },
  "ILLIT": {
    "info": [
      "Illit(/ˈaɪlɪt/;EYE-lit;Korean:아일릿;RR:aillit; stylized inall caps) is a South Koreangirl groupformed by Belift Lab, a sub-label ofHybe, through theJTBC2023 survival competition showR U Next?. The group consists of five members – Yunah, Minju, Moka, Wonhee, and Iroha. The group debuted on March 25, 2024, with theextended play(EP)Super Real Me."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/ILLIT"
  },
  "ILY1": {
    "info": [
      "ILY:1(/aɪliːwʌn/;Korean:아일리원;RR:Ailliwon) is a South Koreangirl groupformed by FC ENM. The group consists of six members: Hana, Ara, Rona, Ririka, Nayu, and Elva. They made their debut on April 4, 2022 with their single albumLove in Bloom."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/ILY:1"
  },
  "ITZY": {
    "info": [
      "Itzy(Korean:있지;RR:Itji;Japanese: イッチ; stylized inall caps) is a South Koreangirl groupformed byJYP Entertainment. The group consists of five members:Yeji,Lia,Ryujin, Chaeryeong, and Yuna. Itzy is recognized for their \"teen crush\" concept and explore themes of independence and self-love in their music.",
      "Itzy debuted on February 12, 2019, with thesingle albumIt'z Differentand its commercially successful lead single \"Dalla Dalla\", which peaked at number two on theCircle Digital Chart, theBillboardK-pop Hot 100, and the USWorld Digital Songschart. It achieved the highest number of views in 24 hours for a K-pop group's debut video and became the best-performing girl group song of the year in South Korea. Itzy was the first K-pop girl group in history to achieve a \"Rookie Grand Slam\" by winning all the Rookie of the Year awards at the 34thGolden Disc Awards, 9thGaon Chart Music Awards, 2019Melon Music Awards, 2019Mnet Asian Music Awards, and 29thSeoul Music Awards.[1][2]",
      "Itzy released the extended playsIt'z Icy,It'z Me,Not Shy, andGuess Whobetween 2019 and 2021, each of which spawned a top-ten single in South Korea: \"Icy\", \"Wannabe\", \"Not Shy\", and \"In the Morning\". The latter EP marked Itzy's first entry on the USBillboard200. In 2021, the group released their debut studio albumCrazy in Love, which peaked at number 11 on theBillboard200. Itzy's fifth EP,Checkmate(2022), was their first to surpass one million copies sold and their first top-ten entry on theBillboard200 at number 8. Its lead single \"Sneakers\" was a commercial success in South Korea, peaking at number five on the Circle Digital Chart and topping theBillboardSouth Korea Songschart. The group achieved two further million-seller albums with their sixth and seventh EPs,Cheshire(2022) andKill My Doubt(2023). Their following two EPs,Born to BeandGold, were released in 2024."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/ITZY"
  },
  "IVE": {
    "info": [
      "IveorIVEmay refer to:"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/IVE"
  },
  "izna": {
    "info": [
      "Izna(Korean:이즈나;RR:Ijeuna;MR:Ijŭna; stylized inall lowercase) is a South Koreangirl groupunderWakeOne, produced byTeddy Park, that was formed through theMnetsurvival showI-Land 2: N/a. The group consists of seven members: Mai, Bang Jee-min, Yoon Ji-yoon, Koko, Ryu Sa-rang, Choi Jung-eun, and Jeong Sae-bi.[1]They debuted on November 25, 2024, with theextended play(EP)N/a."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/izna"
  },
  "Kep1er": {
    "info": [
      "Kep1er(/ˈkɛplər/ⓘ;Korean: 케플러;RR:Kepeulleo;Japanese: ケプラー,Hepburn:Kepurā) is a South Koreangirl groupformed byCJ ENMthrough theMnetreality competitionshowGirls Planet 999in 2021. The group consists of seven members: Kim Chae-hyun, Huening Bahiyyih,Choi Yu-jin, Kim Da-yeon, Seo Young-eun, Ezaki Hikaru, and Shen Xiaoting.[2][3]",
      "The group debuted on January 3, 2022, under the co-management ofWakeOneandSwing Entertainmentwith their firstextended play(EP)First Impact.[4]Upon its release, the group received immediate commercial success, selling approximately 400,000 copies and peaking at number 1 on South Korea'sGaon Album Chart.[5][6]In addition, both the EP and its lead single \"Wa Da Da\" charted on theBillboard Global 200and World Digital Songs respectively.[7]The early success subsequently hailed them as the New Wave of the Year at several awards ceremonies, includingAsia Artist AwardsandSeoul Music Awards.",
      "The group's Japanese debutsingle, \"Fly-Up\", was released on September 7, 2022, under theSony Music Entertainment JapansubsidiaryAriola Japan. Debuting at number two onOricon Singles Chartand with over 100,000 unit sales, the single was certified gold by theRecording Industry Association of Japan(RIAJ).[8][9]",
      "Since September 30, 2024, as part of the label reorganization of Swing Entertainment, Klap Entertainment will be co-managing the group alongside WakeOne.[10]"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/Kep1er"
  },
  "KickFlip": {
    "info": [
      "KickFlip(Korean:킥플립;RR:Kikpeullip) is a South Koreanboy bandformed throughSBS'sreality competitionprogramLoudand managed byJYP Entertainment. The group consists of seven members:  Kyehoon, Amaru, Donghwa, Juwang, Minje, Keiju, and Donghyeon.[1]They debuted on January 20, 2025, with the extended playFlip It, Kick It!."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/KickFlip"
  },
  "KiiiKiii": {
    "info": [
      "KiiiKiii(Korean:키키) is a South Koreangirl groupformed byStarship Entertainment. The group consists of five members: Leesol, Sui, Haum, Jiyu, and Kya. They debuted on March 24, 2025, with the extended playUncut Gem."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/KiiiKiii"
  },
  "KISSOFLIFE": {
    "info": [
      "Kiss of Life(Korean:키스 오브 라이프;RR:Kiseu Obeu Raipeu; stylized inall caps), also known asKIOF, is a South Koreangirl groupformed by S2 Entertainment in 2023. The group consists of four members: Julie,Natty,Belle, and Haneul. They debuted on July 5, 2023, with theextended play(EP)Kiss of Life."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Kiss_of_Life_(group)"
  },
  "LE_SSERAFIM": {
    "info": [
      "Le Sserafim(/ləˈsɛrəfɪm/ləSERR-ə-fim;[4]Korean:르세라핌;RR:Reu Serapim; stylized inall caps) is a South Koreangirl groupformed bySource Music, a sub-label ofHybe. The group consists of five members:Sakura,Kim Chaewon,Huh Yunjin, Kazuha, and Hong Eunchae. Originally a six-member ensemble, member Kim Garam departed from the group in July 2022.",
      "Le Sserafim debuted on May 2, 2022, with the extended playFearless. It was followed in October with their second extended play,Antifragile, which became the group's first release to sell over a million copies and made them the fastest K-pop girl group to debut on the USBillboard200at the time. Both EPs' title tracks reached the top ten of South Korea'sCircle Digital Chartand were certified platinum for streaming in South Korea and Japan.",
      "Le Sserafim's first studio album,Unforgiven(2023), marked their first number-one album on theCircle Album Chartand their first top-ten album on theBillboard200. The album's singles \"Unforgiven\" and \"Eve, Psyche & the Bluebeard's Wife\" peaked at number two in South Korea and were certified gold for streaming in Japan. The group's first English single \"Perfect Night\" (2023) became their first number-one song on the Circle Digital Chart, topping the chart for six weeks. In 2024, Le Sserafim earned their second number-one album in South Korea and top-ten album on theBillboard200 with their third extended playEasy. The EP'stitle trackwas their first entry on the USBillboardHot 100."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/LE_SSERAFIM"
  },
  "MADEIN": {
    "info": [
      "Madein(Korean:메이딘;RR:Meidin), formerly known asLimeLight(라임라잇), is a South Koreangirl groupformed by 143 Entertainment. The group consists of MiU, Suhye, Mashiro,Yeseo, Serina, and Nagomi.",
      "Madein originally debuted under the name LimeLight with a three-member line-up of MiU, Suhye, and Gaeun on February 17, 2023. The group announced their rearrangement in 2024 under the new name Madein, with four new members; adding formerKep1ermembers Mashiro and Kang Yeseo, andProduce 101 Japan The Girlscontestants Serina Saito and Nagomi Abe.[1]Gaeun left the group in November 2024 amid allegations that she was the target of sexual harassment by the CEO of the group's agency, which the company has denied.[2]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Madein"
  },
  "MAMAMOO": {
    "info": [
      "Mamamoo(Korean:마마무;Japanese:ママム; commonly stylized inall caps) is a South Koreangirl groupformed and managed byRBW. The group is composed of four members:Solar,Moonbyul,Wheein, andHwasa. Known for their strong live vocals,harmonies, and writing much of their material, they are recognized as one of the premier girl groups inK-pop.[2][3]They are highly regarded in the industry for their talent and ability to cross multiple genres with their music; from retro, jazz, and R&B concepts in their early years[4]to more contemporary hip-hop,[5]as well as emotional ballads.[6][7]Since their debut in 2014, they have been noted for challenging conventional beauty standards, breaking gender stereotypes, and conducting themselves in ways that most typical K-pop stars do not.[8][9][10][11]",
      "Mamamoo officially debuted on June 18, 2014, with their firstextended play(EP)Hello, featuring the lead single \"Mr. Ambiguous\". Their debut was considered by critics as one of the best K-pop debuts of 2014.[12][13]Mamamoo rose to domestic fame in 2015 with their single \"Um Oh Ah Yeah\" which became asleeper hitand peaked at number three on South Korea'sGaon Digital Chart. Combined with their many appearances and victories in the popular music competition programImmortal Songs, this launched them into mainstream recognition with the public.[14]Their following release of \"You're the Best\" (2016) from their debut studio albumMelting, proved to be a commercial success, and dominated at least eight major music sites upon release,[15]further cementing their popularity and growing momentum. In 2017, they made a splash on the international scene with their fifth EP,Purple. Its lead single \"Yes I Am,\" earned them their first number one on theBillboardWorld Albumschart.[16]",
      "The quartet went on to achieve consecutive hits with the high-charting singles \"Starry Night\" (2018), \"Egotistic\" (2018), \"Gogobebe\" (2019), from their\"Four Seasons, Four Colors\"project whereby every member took turns in becoming the focus for each album.[17]This culminated in their biggest international success to date, \"HIP\" from their second studio albumReality in Blackbecoming a number-one hit on theBillboardWorld Digital Song Saleschart.[18]In November 2020, the song was certified platinum by theKorea Music & Content Association(KMCA) for surpassing 100 million streams, making it their third time achieving this feat.[19]They also earned agoldcertification from theRecording Industry Association of Japan(RIAJ), indicating their breakthrough in the Japanese music scene.[20]",
      "Mamamoo has received numerousaccolades, most notably theGolden Disc Awardfor Best Group, theMnet Asian Music Awardfor Best Vocal Group, multiple honors at theSeoul Music Awards, as well as theGaon Chart Music Awardfor New Artist of the Year in their rookie year."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/MAMAMOO"
  },
  "MEOVV": {
    "info": [
      "Meovv(pronounced \"Meow\";Korean:미야오;RR:Miyao, stylized inall caps) is a South Koreangirl groupformed and managed byThe Black Label. The group consists of five members: Sooin, Gawon,Anna, Narin, andElla. They debuted on September 6, 2024, with the release of theirdigital single\"Meow\"."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/MEOVV"
  },
  "MONSTAX": {
    "info": [
      "Monsta X(Korean:몬스타엑스; stylized asMONSTA X) is a South Koreanboy groupformed through the reality survival programNo.MercyunderStarship Entertainment. The group is currently composed of six members:Shownu,Minhyuk,Kihyun,Hyungwon,Joohoney, andI.M, with former memberWonhohaving left the group in October 2019.",
      "The group debuted with their firstEPTrespasson May 14, 2015.[5]In March 2017, Monsta X released their firststudio albumand the final part ofThe ClanseriesThe Clan Pt. 2.5: The Final Chapter.[6]Since 2018, the group had four Japanese singles certified gold by theRecording Industry Association of Japan, then since 2019, nine of their Korean albums and extended plays had been certified platinum by theKorea Music Content Association. In 2020, the group's first English albumAll About Luv, ranked number five on the USBillboard200and number seven on the USRolling StoneTop 200.[7][8]",
      "Since debut, they had been known for their aggressive style, combining elements ofhip hop,EDMandpop.[1][9]This aggressive style with \"tracks centred around loud, clattering, electronic instrumentals, vicious rap verses, and striking vocals\" had also been influential across the fourth generation ofK-pop,[10]along with breaking gender norms before it was a trend.[11]Additionally, they have been called the \"Next Generation Beast Idol\".[12]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Monsta_X"
  },
  "NCT127": {
    "info": [
      "NCT 127(Korean:엔시티 127;RR:Ensiti Il-i-chil) is the first fixed and second overall sub-unit of the South Koreanboy bandNCT, formed and managed bySM Entertainment. They originally debuted on July 7, 2016, with their debutextended playNCT#127, with an original lineup of seven members:Taeil,Taeyong,Yuta,Jaehyun, Winwin,Mark, andHaechan.Doyoungand Johnny joined the unit in December 2016, ahead of their second EPLimitless,whileJungwoo, the final member, was introduced in September 2018 ahead of their firststudio albumRegular-Irregular. They are known for theirexperimental hip hop-based music, which they refer to as \"neo music\", as well as their vocal and rap abilities, choreographies, and performances.",
      "After debuting in 2016, they broke into the domestic mainstream in 2017 with \"Cherry Bomb\", now recognized as one of their signature songs, and received greater international attention following the release of \"Kick It\" in 2020.",
      "In April 2019, NCT 127's increasing global popularity prompted SM Entertainment to sign marketing and distribution deals withCapitol Music GroupandCaroline Distribution, respectively. The unit subsequently released the EPWe Are Superhumanthat year and their second Korean studio album,Neo Zone, in 2020, the latter becoming their first top-five entry on the USBillboard200and their first release to sell over one million copies.[3]In 2021, NCT 127 released their third Korean studio album,Sticker, and its repackaged versionFavorite. With a combined 3.58 million copies sold, it broke the record for the best-selling album of all time by an act under SM Entertainment and earned the group the Daesang[b]award at the31st Seoul Music Awards.[5][6]Stickerdebuted at number three on theBillboard200, becoming the longest and highest-charting K-pop album in the US in 2021.[7]In 2022, NCT 127 released their fourth Korean studio album2 Baddies, which sold 3.2 million copies and made them the second K-pop act to have three albums debut in the top five of theBillboard200.[8][9][10]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/NCT_127"
  },
  "NCTDREAM": {
    "info": [
      "NCT Dream(Korean:엔시티 드림;RR:Ensiti Deurim) is the third sub-unit of the South Korean boy bandNCT, formed bySM Entertainmentin 2016. They were initially intended to be the teenaged unit of NCT with an admission-and-graduation system, in which members would leave after reaching age of majority (20 inKorean age reckoning, 19 internationally), prior to re-branding in 2020. The sub-unit debuted on August 25, 2016, with the single \"Chewing Gum\" and a lineup of seven members—Mark, Renjun,Jeno,Haechan,Jaemin,Chenle, andJisung—whose average age was 15.6 years old. In late 2018, the group's leader, Mark, graduated from NCT Dream but returned in 2020 when the group began promoting as a fixed seven-member group.",
      "Commercial success of their 2019extended play(EP)We Boommade NCT Dream into one of the year's top 10 physical sellers domestically  and earned themBonsangawards at the34th Golden Disc Awardsand2020 Seoul Music Awards.[4][5][6]Their second and last record released as a sextet was their fourth Korean-language EP,Reload(2020), which accumulated over half a million pre-orders.[7][8]NCT Dream achieved major commercial success with the release of their firststudio album,Hot Sauce(2021), whose pre-orders surpassed 1.71 million copies.[9]It became the best-selling album on theGaon Chartin the first half of 2021 and was named Best Album at the31st Seoul Music Awards.[10][11]",
      "Since their debut, NCT Dream have released four EPs, sixsinglesand twostudio albumsand headlined one tour in Asia. Known for music reflecting youth and adolescence, growth, and the transition from innocence to rebellion,[12]the sub-unit has been recognized internationally as one of the most notable teenaged artists of their time. They are the first and only Asian artist to appear three consecutive times onBillboard's \"21 Under 21\" list for their industry impact on sales, streaming and social media, placing at numbers 20, 13 and 19 from 2018 to 2020.[13][14]NCT Dream were also included onTime's list of the \"25 Most Influential Teens\" of 2018.[12]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/NCT_Dream"
  },
  "NCTWISH": {
    "info": [
      "NCT Wish(Japanese:エヌシーティー·ウィッシュ,Hepburn:Enushītī Wisshu)is a Japaneseboy bandand the sixth and final sub-unit of the South Korean boy bandNCT, formed and managed bySM EntertainmentandAvex Trax, with SM director and soloistBoAin charge as the producer.[2][3]The group consists of six members: Sion, Riku, Yushi, Jaehee, Ryo, Sakuya. They released the single \"Hands Up\" under the tentative name NCT New Team on October 8, 2023, ahead of their scheduled debut in 2024.[4][5]They officially debuted on February 28, 2024, with the single \"Wish\" in both Japanese and Korean versions."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/NCT_Wish"
  },
  "NewJeans": {
    "info": [
      "NewJeans(Korean:뉴진스;RR:Nyujinseu), also known asNJZ(엔제이지;Enjeiji), is a South Koreangirl groupformed by ADOR, a sub-label ofHybe. The group is composed of five members:Minji,Hanni,Danielle,Haerin, andHyein. Mainly produced byMin Hee-jin, they are known for theirgirl next doorimage and musical stylings reminiscent of the 1990s and 2000s.",
      "The group debuted under the name NewJeans on July 22, 2022, with the single \"Attention\", their first number-one song on South Korea'sCircle Digital Chart. It was followed shortly afterwards by two other singles, \"Hype Boy\" and \"Cookie\", with \"Hype Boy\" becoming the longest-running song on theBillboardGlobal 200by a K-pop female act. The singles were all featured on theireponymous debut extended play(EP), released in August 2022. In January 2023, they released their firstsingle album,OMG, to commercial success. It was accompanied by two singles, \"Ditto\" and \"OMG\". \"Ditto\" gained widespread popularity, becoming the longest-running number-one song on the Circle Digital Chart and the group's first entry on both theBillboardHot 100and theUK Singles Chart.",
      "Their second EP,Get Up, peaked at number one on the USBillboard200and sold over one million copies in South Korea. Its lead single, \"Super Shy\", became the group's highest-charting single on theBillboardGlobal 200 (number two), the USBillboardHot 100, and the UK Singles Chart. NewJeans has received rookie awards and was featured in listicles such asTimeNext Generation LeadersandForbesKorea Power Celebrity 40.IFPInamed NewJeans the eighth best-selling artist worldwide in 2023.",
      "In 2024, a dispute over NewJeans' management arose as former ADOR CEO Min Hee-jin and the members clashed with Hybe and ADOR executives. The members sought to terminate their contract, which ADOR denied. In March 2025, the Seoul Central District Court sided with ADOR, blocking the group's independent activities. The group announced a break from all activities in March 2025, with legal cases still ongoing."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/NewJeans"
  },
  "NMIXX": {
    "info": [
      "Nmixx(Korean:엔믹스;RR:Enmikseu;MR:Enmiksŭ, stylized inall caps) is a South Koreangirl groupformed bySQU4D, a sub-label ofJYP Entertainment. The group is composed of six  members:Lily, Haewon, Sullyoon, Bae, Jiwoo, and Kyujin. Originally a seven-piece group,Jinnideparted from the lineup on December 9, 2022, for personal reasons. They debuted on February 22, 2022, with the single albumAd Mare."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/NMIXX"
  },
  "NOWADAYS": {
    "info": [
      "Nowadays(Korean:나우어데이즈;RR:Naueodeijeu;MR:Nauŏdeijŭ; stylized inall caps) is a South Koreanboy bandformed byCube Entertainmentin 2023. The group consists of five members: Hyeonbin, Yoon, Yeonwoo, Jinhyuk, and Siyun. They debuted on April 2, 2024, with theeponymoussingle albumNowadays."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Nowadays_(group)"
  },
  "OHMYGIRL": {
    "info": [
      "Oh My Girl(Korean:오마이걸;RR:Omaigeol, stylized inall capsorOMG) is a South Koreangirl groupformed byWM Entertainment. The group is composed of six members:Hyojung, Mimi,YooA,Seunghee, Yubin andArin. Originally an eight-piece group, JinE left the group in October 2017 due to health issues, and Jiho left in May 2022. Oh My Girl debuted on April 20, 2015, with aneponymous extended play.[2][3]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Oh_My_Girl"
  },
  "ONF": {
    "info": [
      "ONFmay refer to:"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/ONF"
  },
  "PLAVE": {
    "info": [
      "Plave(Korean:플레이브; stylized inall caps) is a South Koreanvirtualboy bandformed by Vlast. The group consists of five members: Yejun, Noah, Bamby, Eunho, and Hamin."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Plave"
  },
  "PURPLEKISS": {
    "info": [
      "Purple Kiss(Korean:퍼플키스; stylized inall caps) is a South Koreangirl groupformed byRBWin 2020. The group consists of six members: Na Go-eun, Dosie, Ireh, Yuki, Chaein andSwan.[1]Originally a seven-member group, Park Ji-eun left the group on November 18, 2022, due to health issues. They are considered to be a self-producing group, with members involved in songwriting, composing and other aspects of their music and showmanship.[2][3]",
      "The group released two pre-debut digital singles—\"My Heart Skip a Beat\" in November 2020, and \"Can We Talk Again\" in February 2021—before their official debut on March 15, 2021, with theEPInto Violet.[4][5][6]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Purple_Kiss"
  },
  "RedVelvet": {
    "info": [
      "Red velvetmay refer to:"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Red_Velvet"
  },
  "RIIZE": {
    "info": [
      "Riize(Korean:라이즈;RR:Raijeu; stylized inall caps; pronounced as \"Rise\") is a South Koreanboy bandformed bySM Entertainment. The group consists of six members: Shotaro, Eunseok, Sungchan, Wonbin, Sohee, and Anton. Originally a seven-piece ensemble,Seunghandeparted from the group in October 2024. They debuted on September 4, 2023, with thesingle albumGet a Guitar."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Riize"
  },
  "RocketPunch": {
    "info": [
      "Rocket Punch(Korean:로켓펀치;RR:Roketpeonchi;Japanese:ロケットパンチ,romanized:Rokettopanchior asRCPC) was a South Korean girl group formed and managed byWoollim Entertainmentin 2019. The group consisted of six members: Yeonhee, Suyun, Yunkyoung, Sohee, and Dahyun. Former memberJurideparted from the group on May 24, 2024, after her contract with Woollim expired.[1]They debuted on August 7, 2019, with theextended play(EP)Pink Punch.[2][3]Yeonhee, Yunkyoung, Sohee, and Dahyun left on December 31, 2024, due to their contracts also expiring.[4]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Rocket_Punch"
  },
  "SAYMYNAME": {
    "info": [
      "Say My Name(Korean:세이마이네임;RR:Seimaineim) is a South Koreangirl groupformed and managed by Inkode. The group consist of seven members:Hitomi, Mei, Kanny, Soha, Dohee, Junhwi, and Seungjoo. They debuted on October 16, 2024, with theeponymous EP."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Say_My_Name_(group)"
  },
  "SEVENTEEN": {
    "info": [
      "Seventeen(Korean:세븐틴;RR:Sebeuntin; stylized inall capsor asSVT) is a South Koreanboy bandformed byPledis Entertainment. The group consists of thirteen members:S.Coups,Jeonghan,Joshua,Jun,Hoshi,Wonwoo,Woozi,DK,Mingyu,The8,Seungkwan,Vernon, andDino. Throughout their career, they have reached a large audience and grown into an internationally recognized K-pop group with signature music and performances.",
      "The group debuted on May 26, 2015, with theextended play(EP)17 Carat, which became the longest-charting K-pop album of the year in the US and the only rookie album to appear onBillboard's \"10 Best K-Pop Albums of 2015\" list. The group's 2023 EPsFMLandSeventeenth Heavenboth set records for the best-sold albums in history, withFMLearning the group their firstMAMA Award for Album of the Yearand becoming the best selling album of the year according to theInternational Federation of the Phonographic Industry.[2]",
      "Seventeen is considered a \"self-producing\"idol group, with the members involved in songwriting, music production, and choreographing, among other aspects of their music and performances. They perform as one group and are divided into three units—hip-hop, vocal, and performance—each with a different area of specialization. They have been labeled \"Performance Kings\" and \"K-pop Performance Powerhouse\" by various domestic and international media outlets.[3][4][5][6]"
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Seventeen_(South_Korean_band)"
  },
  "SF9": {
    "info": [
      "SF9(Korean:에스에프나인;RR:Eseuepeunain;MR:Esŭep'ŭnain; shortened fromSensational Feeling 9) is a South Koreanboy bandformed byFNC Entertainmentand the company's first dance boy group.[1]The group is composed of eight members: Youngbin, Inseong,Jaeyoon, Dawon, Zuho, Yoo Taeyang,Hwiyoung, andChani. Originally a nine-member group,Rowoonleft the group on September 18, 2023, to focus on acting. They debuted on October 5, 2016, with the release of their first single album,Feeling Sensation.[2]"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/SF9"
  },
  "SHINEE": {
    "info": [
      "Shinee(/ˈʃaɪniː/SHY-nee;Korean:샤이니,romanized:Syaini;Japanese:シャイニー,romanized:Shainī; stylized asSHINee) is a South Koreanboy bandformed bySM Entertainmentin 2008. The group consists of four members:Onew,Key,Minho, andTaemin. Originally a five-piece band,Jonghyundied in December 18, 2017. The group's musical impact in their native country has earned them numerous accolades and the title \"Princes of K-pop\".[1][2][3]",
      "Shinee debuted in May 2008 with their firstextended play(EP),Replay, fronted by the singleof the same name. The group gained attention for starting a fashion trend amongst students, which the media dubbed the \"Shinee Trend\". In August 2008, the group released their first Korean studio album,The Shinee World, which won Newcomer Album of the Year at the23rd Golden Disc Awards. Shinee further consolidated their popularity on the South Korean music scene with follow-up singles \"Ring Ding Dong\" and \"Lucifer\". \"Ring Ding Dong\" charted on top of several Korean music charts and gained popularity all over Asia. \"Lucifer\" was nominated for the Best Dance Performance Award at theMnet Asian Music Awardsin 2010 for its outstanding choreography. In 2012, the group releasedSherlock, which became the fifth best-selling album of the year with over 180,000 copies sold. Subsequent albums includedThe Misconceptions of Us(2013),Odd(2015),1 of 1(2016),The Story of Light(2018),Don't Call Me(2021), andHard(2023). The group has also been included in theForbesKorea Power Celebrity 40twice (2014, 2016).",
      "In mid-2011, Shinee signed withEMI Music Japanto venture into the Japanese music scene. Their Japanese version of their single \"Replay\" sold over 100,000 copies, the highest number of sales for a Japanese debut single recorded byOriconfor a South Korean group at the time. It was followed by their first Japanese studio album,The First, on December 7, 2011 – both were certified Gold byRIAJfor selling over 100,000 copies. In 2011, the group also held their Japan Debut Premium Reception atAbbey Road Studiosin London, making them the first Asian artists to perform there. Two years later, they released their second Japanese albumBoys Meet U(2013), followed byI'm Your Boy(2014),D×D×D(2016), andFive(2017).",
      "Shinee is considered to be one of the best live vocal groups in K-pop and is known for their highly synchronized and complex dance routines, having been awarded the Best Dance Performance Award at the Mnet Asian Music Awardsthree timesin a row for their dance performances to \"Sherlock (Clue + Note)\", \"Dream Girl\" and \"View\". Shinee's signature musical style is contemporary R&B, but the group is known for their experimental sound, incorporating various genres includingfunk rock,hip hop, andEDM."
    ],
    "name_used": "korean",
    "url": "https://en.wikipedia.org/wiki/샤이니"
  },
  "STAYC": {
    "info": [
      "STAYC(/ˈsteɪsi/;Korean:스테이씨;RR:Seuteissi, acronym forStar to a Young Culture) is a South Koreangirl groupformed byHigh Up Entertainment. The group is composed of six members: Sumin,Sieun, Isa, Seeun, Yoon, and J. Mainly produced byK-popduoBlack Eyed Pilseung, they debuted on November 12, 2020, with the release of their debut single albumStar to a Young Culture. From September 2023 to March 2024 they embarked on their first world tour."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/STAYC"
  },
  "StrayKids": {
    "info": [
      "Stray Kids(Korean:스트레이 키즈;RR:Seuteurei Kijeu; often abbreviated toSKZ) is a South Koreanboy bandformed byJYP Entertainment. The band consists of eight members:Bang Chan,Lee Know,Changbin,Hyunjin,Han,Felix,Seungmin, andI.N. For undisclosed personal reasons,Woojinleft the band in October 2019. Stray Kids primarily self-produce its recordings; the main production team is named 3Racha and consists of Bang Chan, Changbin, and Han, and the other members frequently participate in songwriting.",
      "Bang Chan handpicked each member to be a part of the group before the filming of the eponymous2017 reality television show, which is uncommon in K-Pop where that power typically lies with executives and creative directors.[1]The band released their unofficial debutextended play(EP)Mixtapein January 2018 and officially debuted on March 25 with the EPI Am Not, which was followed by the EPsI Am WhoandI Am You, completing theI AmEP series. TheClétrilogy, consisting ofClé 1: Miroh,Clé 2: Yellow Wood, andClé: Levanter, was released in 2019.",
      "The group's first studio albumGo Live(2020) become the band's first platinum-certified album byKorea Music Content Association(KMCA). That year, Stray Kids made their Japanese debut with the compilation albumSKZ2020, which was released throughEpic Records Japan. Their debut Japanese single \"Top\" debuted atop theOricon Singles Chart, the fourth foreign male artists to do so with the first single.",
      "In 2021, Stray Kids' second studio albumNoeasybecame its first million-selling album. After signing withRepublic Recordsfor promotions in the United States in 2022, the band released their EPsOddinary,Maxident(both 2022),Rock-Star(2023), andAte(2024); their third studio album5-Star(2023); and their first mixtapeHop(2024). These six releases peaked at number one on the USBillboard200and entered theUK Albums Chart, making them the first act to debut at the top ofBillboard200 with their first-sixth-charted albums. TheKMCAcertified5-Starfive-million in album sales, making Stray Kids the third group to achieve this in Korea. In 2023, the band appeared onTime'slist ofNext Generation Leaders. As of December 2024, Stray Kids has sold over 31 million albums, both Korean and Japanese releases."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Stray_Kids"
  },
  "THEBOYZ": {
    "info": [
      "The Boyz(Korean:더보이즈) is a South Koreanboy bandformed byIST Entertainment(initially formed exclusively by Cre.ker Entertainment before merging with what was formerly known as Play M Entertainment) and managed by One Hundred. The group debuted on December 6, 2017, with the lead single \"Boy\" from their debut EPThe First. The group is composed of members Sangyeon, Jacob, Younghoon, Hyunjae, Juyeon, Kevin, New, Q, Ju Haknyeon, Sunwoo, and Eric. Originally a twelve-man group,Hwalldeparted from the group in October 2019, citing health issues."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/The_Boyz_(South_Korean_band)"
  },
  "TOMORROW_X_TOGETHER": {
    "info": [
      "Tomorrow X Together(Korean:투모로우바이투게더;Tomorrow by Together, stylized inall caps), commonly abbreviated asTXT, is a South Koreanboy groupformed byBig Hit Entertainment. The group consists of five members:Yeonjun, Soobin,Beomgyu, Taehyun, and HueningKai.",
      "They debuted on March 4, 2019, with theextended play(EP)The Dream Chapter: Star. The EP debuted and peaked at number one on theGaon Album ChartandBillboardWorld Albums Chartand entered the USBillboard200at number 140, the highest-charting debut album by any male K-pop group at the time. Its lead single \"Crown\" debuted at number one on theBillboardWorld Digital Songschart. The group also topped theBillboardEmerging Artistschart. TXT was the first Korean boy band to perform and headline atLollapalooza, one of the biggest music festivals in the US.",
      "The band's early commercial success earned them several new artist awards, including Rookie of the Year at the 34thGolden Disc Awardsand the 2019Melon Music Awards, New Artist of the Year at the 9thGaon Chart Music Awards, and Best New Male Artist at the 2019Mnet Asian Music Awards."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Tomorrow_X_Together"
  },
  "TREASURE": {
    "info": [
      "Treasure(Korean:트레저,romanized:Teurejeo;Japanese:トレジャー,romanized:Torejā; stylized inall caps) is a South Koreanboy bandformed in 2019 byYG EntertainmentthroughYG Treasure Box(2018–2019); and consists of 10 members:Choi Hyun-suk,Jihoon, Yoshi, Junkyu, Yoon Jae-hyuk, Asahi, Doyoung, Haruto, Park Jeong-woo, and So Jung-hwan. Its former members, Mashiho andBang Ye-dam, departed from the group in November 2022. Treasure debuted with the single albumThe First Step: Chapter One(2020)—the first in atetralogyof albums which collectively sold over one million copies in five months."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Treasure_(band)"
  },
  "tripleS": {
    "info": [
      "TripleS(/ˈtɹɪpəlːɛs/;Korean:트리플에스;RR:Teuripeul-eseu; stylized astripleS) is a South Korean 24-member multinationalgirl groupformed by Modhaus. They aim to be the world's first decentralized idol group, where the members will rotate between the full group, sub-units, and solo activities, as chosen by fans.[2]Fans are able to participate and communicate with the group, such as deciding the sub-units and the content throughNFTphoto cards called \"Objekts\".",
      "The group's concept is that each member has the special ability \"S\", and they will join forces to demonstrate their abilities through the \"Dimension\" that will be recreated every season with new concepts.",
      "They made their official debut as a group on February 13, 2023, with theirextended play(EP)Assemble."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/tripleS"
  },
  "TWICE": {
    "info": [
      "Twice(Korean:트와이스;RR:Teuwaiseu;Japanese: トゥワイス,Hepburn:Tuwaisu; commonly stylized inall caps) is a South Koreangirl groupformed byJYP Entertainment. The group is composed of nine members:Nayeon,Jeongyeon,Momo,Sana,Jihyo,Mina,Dahyun,Chaeyoung, andTzuyu. Twice was formed under the television programSixteen(2015) and debuted on October 20, 2015, with theextended play(EP)The Story Begins, and has received the honorific title of \"The Nation's Girl Group\" in their home country.",
      "Twice rose to domestic fame in 2016 with their single \"Cheer Up\", which charted at number one on theGaon Digital Chart, became thebest-performing singleof the year, and won \"Song of the Year\" at theMelon Music AwardsandMnet Asian Music Awards. Their next single, \"TT\", from their third EPTwicecoaster: Lane 1, topped the Gaon charts for four consecutive weeks. The EP was the highest selling Korean girl group album of 2016. Within 19 months after debut, Twice had already sold over 1.2 million units of their four EPs and special album. As of 2022, the group has sold over 14 million albums cumulatively in South Korea and Japan.",
      "The group debuted in Japan on June 28, 2017, underWarner Music Japan, with the release of a compilation album titled#Twice. The album charted at number 2 on theOricon Albums Chartwith the highest first-week album sales by a K-pop artist in Japan in two years. It was followed by the release of Twice's first original Japanesemaxi singletitled \"One More Time\" in October. Twice became the first Korean girl group to earn aplatinumcertification from theRecording Industry Association of Japan(RIAJ) for both an album andCD singlein the same year. Twice ranked third in the Top Artist category ofBillboard Japan's 2017 Year-end Rankings, and in 2019, they became the first Korean girl group to embark on a Japanese dome tour.",
      "Twice is the first female Korean act to simultaneously top bothBillboard'sWorld AlbumsandWorld Digital Song Salescharts with the release of their first studio albumTwicetagramand its lead single \"Likey\" in 2017. With the release of their single \"Feel Special\" in 2019, Twice became the third female Korean act to chart into theCanadian Hot 100. After signing withRepublic Recordsfor American promotions as part of a partnership with JYP Entertainment, the group achieved five top-ten albums on the USBillboard200and topped the chart in 2024 with their thirteenth extended playWith You-th. Their first official English-language single, \"The Feels\" (2021), became their first song to enter the USBillboardHot 100and theUK Singles Chart, peaking at the 83rd and 80th positions of the charts, respectively. Their point choreography—including for \"Cheer Up\" (2016), \"TT\" (2016), \"Signal\" (2017), and \"What Is Love?\" (2018)—became dance crazes and viralmemes."
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/TWICE"
  },
  "TWS": {
    "info": [
      "TWSmay refer to:"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/TWS"
  },
  "UNIS": {
    "info": [
      "UNISorUnismay refer to:"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/UNIS"
  },
  "VIVIZ": {
    "info": [
      "Viviz(Korean:비비지;RR:Bibiji; stylized inall caps) is a South Korean girl group formed byBPM Entertainment. The group consists ofGFriendmembersEunha,SinB, andUmji. The group debuted on February 9, 2022, with their first extended play,Beam of Prism."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Viviz"
  },
  "WINNER": {
    "info": [
      "Winner(/wɪnə/;Korean:위너; stylized inall caps) is a South Koreanboy bandconsisting of four members:Kim Jin-woo,Lee Seung-hoon,Mino, andKang Seung-yoon; originally a five-piece band,Nam Tae-hyundeparted in November 2016 for reasons associated to his mental health. Their immediate success was cited as \"unprecedented\" for a newly debuted artist, thereby birthing the moniker \"Monster Rookies\" within the industry. The band's musical impact in their native country further trademarked the act as a \"Trust and Listen\" group and as the \"Kings of Summer\".",
      "Formed in 2013 byYG EntertainmentandMnet'sWIN: Who Is Next, the band debuted the next year with the studio album2014 S/S. As of March 2019, Winner has been recorded as the fastest Korean act to top theBillboardWorld Album Chartwith the oeuvre, and theGaon Music Chartwith their album and its titular single, \"Empty\". The band remains the fastest act to win on a televised music show, with a time of five days, and is the only artist to have all of their lead singles top the platform,Melon, for five consecutive years since their first work. Their success in Asia bestowed them with numerous accolades for music, fashion, and popularity, from award shows such as theMelon Music Awards, theStyle Icon Awards, and theMTV Asia Music Gala. Following the band's reformation, their lead single, \"Really Really\" from their first single albumFate Number For(2017), sold over 2.5 million digital copies in their country and surpassed 100 million streams on the Gaon Music Chart; ensuing as the history's firstK-popmale act to achieve the record without it departing from the chart.",
      "Cited as a \"self-producing\" artist with all four members actively adopting roles from producing and choreographing to designing and marketing, their leader and youngest member, Kang Seung-yoon, is often portrayed as the act's main producer. They are also proclaimed as a \"blue chip\" due to their demand in the advertising industry, resulting in the endorsements with brands such asAdidas,Oreo, andKiehl's. Furthermore, Winner actively participates in charitable activities and animal campaigns."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Winner_(band)"
  },
  "WJSN": {
    "info": [
      "WJSN(Korean:우주소녀;RR:Ujusonyeo;Chinese:宇宙少女), also known asCosmic Girls, is a South Koreangirl groupformed byStarship EntertainmentandYuehua Entertainment. The group is composed of ten members:Seola,Bona,Exy, Soobin,Luda,Dawon, Eunseo, Yeoreum, Dayoung, andYeonjung. Originally a thirteen-member group,Xuanyi,Cheng Xiao, andMeiqideparted from the group on March 3, 2023. The group debuted on February 25, 2016, with the extended playWould You Like?"
    ],
    "name_used": "english",
    "url": "https://en.wikipedia.org/wiki/WJSN"
  },
  "YOUNGPOSSE": {
    "info": [
      "Young Posse(Korean:영파씨;RR:Yeongpassi; stylized inall caps) is a South Koreangirl groupunderDSP Mediaand co-produced by Beats Entertainment, an independent record label. The group consists of members Sunhye, Yeonjung, Jiana, Doeun, and Jieun. They made their debut on October 18, 2023, with the extended playMacaroni Cheese."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Young_Posse"
  },
  "ZEROBASEONE": {
    "info": [
      "Zerobaseone(stylized inall caps; abbreviated asZB1;Korean:제로베이스원;RR:Jerobeiseuwon) is a South Koreanboy bandformed throughMnet'sreality competitionprogramBoys Planetand managed byWakeOne. The group consists of nine members:Kim Ji-woong,Zhang Hao,Sung Han-bin, Seok Matthew, Kim Tae-rae, Ricky, Kim Gyu-vin, Park Gun-wook, and Han Yu-jin.",
      "Zerobaseone debuted on July 10, 2023, with theextended play(EP)Youth in the Shadeand was commercially successful upon release, selling over two million units, peaked number one on South KoreanCircle Album Chart, and was among the best-selling albums worldwide, according toInternational Federation of the Phonographic Industry(IFPI). In addition, the EP's lead single, \"In Bloom\", charted onBillboardGlobal 200. The group earned a \"Rookie Grand Slam\" (2023–2024) by sweeping the 10 Rookie of the Year awards from different domestic award ceremonies, includingGolden Disc Awards,MAMA Awards,Melon Music Awards, andSeoul Music Awards. They will be active for two years and six months."
    ],
    "name_used": "alternative",
    "url": "https://en.wikipedia.org/wiki/Zerobaseone"
  }
}